<!-- dflook/terraform-github-actions {"workspace":"isolate-creds","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"784d51702b8267946e36c5564e59336d203eb9af75e7833dcb77ee1152bd7775","plan_job_ref":"Job Test plan target and replace #394 at https://github.com/dflook/terraform-github-actions/actions/runs/7314697358","plan_hash":"72477ef894eb9c4c193bdc7dbac13e6067f65783f2772b1a5213249450b7be4d","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __isolate-creds__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "jQzxkiAXYv" -> (known after apply)
!~  foreach = "1JrBuANfaE" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #394](https://github.com/dflook/terraform-github-actions/actions/runs/7314697358)